ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-azuretools.vscode-docker
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers
eamodio.gitlens
redhat.vscode-yaml
hashicorp.terraform
ms-kubernetes-tools.vscode-kubernetes-tools
github.copilot
yzhang.markdown-all-in-one
editorconfig.editorconfig
charliermarsh.ruff
ms-python.black-formatter
ms-python.isort
timonwong.shellcheck
ms-vscode.makefile-tools
bungcip.better-toml
